frontend/controllers/QuestionsController.php

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
            return $this->redirect(['view', 'id' => $model->id]);
        } else {
            return $this->render('update.twig', [
                'model' => $model,
                'categories' => Category::find()->select(['name', 'id'])->indexBy('id')->column()
---
SELECT `name`, `id` FROM `category`

    protected function findModel($id)
    {
        if (($model = Question::findOne($id)) !== null) {
---
SELECT * FROM `question` WHERE `id`='31'

    private function getStatistics() {
        return [
            'new' => Question::find()->where("is_blocked=0 AND state='".Question::STATE_DRAFT."'")->count(),
            'published' => Question::find()->where("is_blocked=0 AND state IN ('".Question::STATE_PUBLISHED."', '".Question::STATE_HIDDEN."')")->count(),
            'blocked' => Question::find()->where("is_blocked=1")->count(),
        ];
---
SELECT COUNT(*) FROM `question` WHERE is_blocked=0 AND state='draft'
SELECT COUNT(*) FROM `question` WHERE is_blocked=0 AND state IN ('published', 'hidden')
SELECT COUNT(*) FROM `question` WHERE is_blocked=1

    private function getCategoriesForFilters() {
        return array_replace([-1 => '-- empty -- '], Category::find()->select(['name', 'id'])->indexBy('id')->column());
---
SELECT `name`, `id` FROM `category`