frontend/controllers/SiteController.php

SELECT * FROM `category` WHERE (SELECT
                        COUNT(*)
                    FROM question q
                        WHERE
                            q.id_category = category.id
                            AND q.is_blocked=0
                            AND q.state="published") > 0
---
    public function actionIndex()
    {
        $categories = new ActiveDataProvider([
            'query' => Category::find()
                ->where('(SELECT
                        COUNT(*)
                    FROM question q
                        WHERE
                            q.id_category = category.id
                            AND q.is_blocked=0
                            AND q.state="published") > 0')
                ->all(),
        ]);