frontend/models/Category.php

SELECT COUNT(*) FROM `question` WHERE id_category=3
---
    public function getTotalQuestionsNumber() {
        return Question::find()
            ->where("id_category={$this->id}")
            ->count();

SELECT COUNT(*) FROM `question` WHERE (state='published') AND (id_category=3)
---
    public function getPublishedQuestionsNumber() {
        return Question::find()
            ->where("state='" . Question::STATE_PUBLISHED . "'")
            ->andWhere("id_category={$this->id}")
            ->count();

SELECT COUNT(*) FROM `question` WHERE (state='draft') AND (id_category=3)
---
    public function getNewQuestionsNumber() {
        return Question::find()
            ->where("state='" . Question::STATE_DRAFT . "'")
            ->andWhere("id_category={$this->id}")
            ->count();