frontend/models/Question.php

SELECT * FROM `stopword` WHERE `id`='2'
---
    private function checkWithStopwords() {
        $result = null;

        $stopwords = Stopword::find()->all();