frontend/models/Question.php

SELECT * FROM `stopword`
---
    public function save($runValidation = true, $attributeNames = null)
    {
        $needToUpdate = false;

        if (!$this->isNewRecord) {
            if ($this->state != self::STATE_DRAFT && $this->answer == '') {
                $this->addError('state', 'You cannot publish question without answer!');
            }
            $needToUpdate = true;
        }
        else {
            $result = parent::save($runValidation, $attributeNames);
        }

        if ($this->hasErrors()) {
            return null;
        }

        $currentStopWords = $this->stopwords;
        foreach($currentStopWords as $stopword) {
            $this->unlink('stopwords', $stopword, true);
        }

        $stopwords = Stopword::find()->all();

SELECT * FROM `stopword` WHERE 0=1
---
    public function getStopwordsBubles() {
        $stopwords = $this->getStopwords()->all();